src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Штрихкоды/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция, вовращает данные объекта по штрихкоду.
//
Функция ПолучитьДанныеПоШтрихкодам(Штрихкод, ИскатьВСериях = Ложь) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	Рег.Штрихкод КАК Штрихкод,
	|	Рег.Объект КАК Объект,
	|	Рег.Упаковка КАК Упаковка,
	|	Рег.ПартииНоменклатуры КАК ПартииНоменклатуры,
	|	Рег.Действие КАК Действие
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Рег
	|ГДЕ
	|	Рег.Штрихкод = &Штрихкод
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПартииНоменклатуры.Наименование,
	|	ПартииНоменклатуры.Владелец,
	|	NULL,
	|	ПартииНоменклатуры.Ссылка,
	|	NULL
	|ИЗ
	|	Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
	|ГДЕ
	|	НЕ ПартииНоменклатуры.ПометкаУдаления
	|	И ПартииНоменклатуры.Наименование = &Штрихкод
	|	И &ИскатьВСериях");		
	
	Запрос.УстановитьПараметр("Штрихкод"     , Штрихкод);
	Запрос.УстановитьПараметр("ИскатьВСериях", ИскатьВСериях);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеПоШтрихкодам = Новый Структура;
	Пока Выборка.Следующий() Цикл
		ДанныеПоШтрихкодам.Вставить("ШтрихКод"      , Выборка.Штрихкод);
		ДанныеПоШтрихкодам.Вставить("Объект"        , Выборка.Объект);		
		ДанныеПоШтрихкодам.Вставить("Упаковка"      , Выборка.Упаковка);
		ДанныеПоШтрихкодам.Вставить("Партия"        , Выборка.ПартииНоменклатуры);
		ДанныеПоШтрихкодам.Вставить("Действие"      , Выборка.Действие);
		
		Если ТипЗнч(Выборка.Объект.Ссылка) = Тип("СправочникСсылка.Карты") Тогда 
			ДанныеПоШтрихкодам.Вставить("Ссылка"       , Выборка.Объект.Ссылка);
			ДанныеПоШтрихкодам.Вставить("ВладелецКарты", Выборка.Объект.Ссылка.ВладелецКарты);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДанныеПоШтрихкодам;
	
КонецФункции

Функция КонтрольныйСимволEAN(ШтрихКод, Тип) Экспорт
	
	Четн   = 0;
	Нечетн = 0;
	
	КоличествоИтераций = ?(Тип = 13, 6, 4);
	
	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) и (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;
	
	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;
	
	КонтЦифра = 10 - (Четн + Нечетн) % 10;
	
	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));
	
КонецФункции // КонтрольныйСимволEAN()

// Функция, осуществляет формирование нового внутреннего штрихкода для.
// штучного товара
//
// Параметры
//  Код  – <Число> 
//       – Измерение "Код" регистра сведений Штрихкоды
//
// Возвращаемое значение:
//  <Строка>
//       – сформированный штрихкод
//
Функция СформироватьШтрихкодEAN13(ПрефиксШтучногоТовара = "0", ПрефиксВнутреннегоШтрихкода = "00") Экспорт
	
	Код = Мин(ПолучитьМаксимальноеЗначениеКодаШтрихкодаЧислом(ПрефиксШтучногоТовара, ПрефиксВнутреннегоШтрихкода) + 1, 99999999);

	Возврат ПолучитьШтрихкодПоКоду(Код, ПрефиксШтучногоТовара, ПрефиксВнутреннегоШтрихкода);

КонецФункции // СформироватьШтрихкодEAN13()

Функция ПолучитьМаксимальноеЗначениеКодаШтрихкодаЧислом(ПрефиксШтучногоТовара = "0", ПрефиксВнутреннегоШтрихкода = "00") Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ПОДСТРОКА(Штрихкоды.Штрихкод, 5, 8)) КАК Код
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод ПОДОБНО ""2" + ПрефиксШтучногоТовара + ПрефиксВнутреннегоШтрихкода + "_________""
	|");

	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ОписаниеТипаЧисла = Новый ОписаниеТипов("Число");
	ЗначениеКодаЧислом = ОписаниеТипаЧисла.ПривестиЗначение(Выборка.Код);
	
	Возврат ЗначениеКодаЧислом;

КонецФункции // ПолучитьМаксимальноеЗначениеКодаШтрихкодаЧислом()

Функция ПолучитьШтрихкодПоКоду(Код, ПрефиксШтучногоТовара = "0", ПрефиксВнутреннегоШтрихкода = "00") Экспорт

	Штрихкод = "2" + ПрефиксШтучногоТовара + ПрефиксВнутреннегоШтрихкода + Формат(Код, "ЧЦ=8; ЧВН=; ЧГ=");
	Штрихкод = Штрихкод + КонтрольныйСимволEAN(ШтрихКод, 13);
	
	Возврат Штрихкод;

КонецФункции // ПолучитьШтрихкодПоКоду()

// Функция, возвращает штрихкод по объекту.
//
Функция ПоулчитьШтрихкодПоОбъекту(Объект, Партия = Неопределено) Экспорт
		 	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Штрихкоды.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект = &Объект
	|	И ВЫБОР
	|			КОГДА &Партия <> НЕОПРЕДЕЛЕНО
	|				ТОГДА Штрихкоды.ПартииНоменклатуры = &Партия
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ");
	
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Партия", ?(ЗначениеЗаполнено(Партия), Партия, Неопределено));

	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Штрихкод, Неопределено);
	
КонецФункции

#КонецОбласти
